{
    "What is a VPN?": "A VPN, or Virtual Private Network, is a service that encrypts your internet connection and routes it through a server in another location, masking your IP address and protecting your online identity.",
    "What is phishing?": "Phishing is a type of cyber attack where attackers disguise themselves as a trustworthy entity in digital communication. The goal is to trick individuals into providing sensitive data such as personal information, banking details, and passwords.",
    "What are malware and viruses?": "Malware is malicious software designed to harm, exploit, or perform unauthorized actions on a computer system. A virus is a type of malware that can replicate itself and spread to other computers. Viruses often attach themselves to legitimate programs and execute harmful actions.",
    "What is two-factor authentication?": "Two-factor authentication (2FA) is a security process in which users provide two different authentication factors to verify themselves. This method adds an additional layer of security to the user verification process.",
    "What are firewalls?": "Firewalls are network security devices that monitor and control incoming and outgoing network traffic based on predetermined security rules. They act as a barrier between a trusted internal network and untrusted external networks, such as the Internet.",
    "What is a secure password?": "A secure password is typically at least 12 characters long and includes a combination of upper and lower case letters, numbers, and special characters. It should not contain easily guessable information, such as common words or personal information.",
    "What is ransomware?": "Ransomware is a type of malware that encrypts a victim's files, making them inaccessible. The attacker then demands a ransom from the victim to restore access to the data upon payment.",
    "What is social engineering?": "Social engineering is a tactic used by cybercriminals to trick individuals into revealing confidential information. It involves manipulating individuals into breaking normal security procedures, often through psychological manipulation.",
    "How can I protect my personal data?": "To protect your personal data, use strong, unique passwords for different accounts, enable two-factor authentication, regularly update software, be cautious about the information you share online, and use security software like antivirus programs.",
    "What is a cyber attack?": "A cyber attack is an attempt by hackers to damage or destroy a computer network or system. Cyber attacks can take many forms, including malware, phishing, ransomware, and denial of service attacks.",
    "What is a brute force attack?": "A brute force attack is a trial-and-error method used by attackers to decode encrypted data such as passwords or Data Encryption Standard (DES) keys, by trying many combinations.",
    "What is a denial-of-service attack?": "A denial-of-service (DoS) attack is a malicious attempt to disrupt normal traffic of a targeted server, service, or network by overwhelming the target or its surrounding infrastructure with a flood of Internet traffic.",
    "What is encryption?": "Encryption is the process of converting information or data into a code, especially to prevent unauthorized access. It's a key concept in cybersecurity used to protect data confidentiality.",
    "What is a digital certificate?": "A digital certificate is an electronic 'passport' that allows a person, computer, or organization to exchange information securely over the Internet using the public key infrastructure (PKI).",
    "What is multi-factor authentication?": "Multi-factor authentication (MFA) is a security system that requires more than one method of authentication from independent categories of credentials to verify the user's identity for a login or other transaction.",
    "What are the common signs of a malware-infected system?": "Common signs include slow computer performance, frequent crashes, pop-up advertisements, spam emails being sent from your account, and programs running or shutting down unexpectedly.",
    "What is a secure socket layer (SSL)?": "SSL is a standard security technology for establishing an encrypted link between a server and a client—typically a web server (website) and a browser, or a mail server and a mail client."
}
